# ClosePoly

## Description
Procedures ClosePoly set the polygon creation mode for polygon objects created in VectorScript to closed. To turn this mode off, use Procedure OpenPoly; the two modes used in conjunction will act as a toggle for the feature.

```pascal
PROCEDURE ClosePoly;
```

```python
def vs.ClosePoly():
    return None
```

## Examples
==== VectorScript ====
```pascal
ClosePoly;
Poly(0,0,1,1,1,-1);
{creates a closed 3 sided polygon}
```
==== Python ====
```python
vs.ClosePoly()
vs.Poly(0,0,1,1,1,-1)
#{creates a closed 3 sided polygon}
```

## See Also
<listTable indent="1" cols="4">
AddPoint|AddPoint
ArcTo|ArcTo
BeginPoly|BeginPoly
ClosePoly|ClosePoly
CurveThrough|CurveThrough
CurveTo|CurveTo
DelVertex|DelVertex
EndPoly|EndPoly
GetHole|GetHole
GetNumHoles|GetNumHoles
GetPolylineVertex|GetPolylineVertex
GetPolyPt|GetPolyPt
GetVertexVisibility|GetVertexVisibility
GetVertNum|GetVertNum
InsertVertex|InsertVertex
OpenPoly|OpenPoly
Poly|Poly
SetPolylineVertex|SetPolylineVertex
SetPolyPt|SetPolyPt
SetVertexVisibility|SetVertexVisibility
Smooth|Smooth
</listTable>

## Version
Availability: from All Versions

## Category
* Objects - Polys